<a href="https://colab.research.google.com/github/neerajthandayan/CourseProject/blob/main/Notebooks/PoliceDept_Diversity.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Calculating the Diversity of Police Forces in England and Wales

In [1]:
# Loading Libraries

import pandas as pd
import numpy as np

In [2]:
# Data Retrieved From: https://www.gov.uk/government/statistics/police-service-strength-england-and-wales-31-march-2012

df = pd.read_excel('https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/115784/hosb0912-tabs.xls', sheet_name='Table 8', header=4)
df = df.iloc[:43,:-3]
df = df.drop(columns=['Not stated','Total male'])
df.head(5)

          Unnamed: 0  ...  Chinese or Other ethnic group.1
0  Avon and Somerset  ...                              1.0
1       Bedfordshire  ...                              0.0
2     Cambridgeshire  ...                              1.0
3           Cheshire  ...                              0.0
4          Cleveland  ...                              1.0

[5 rows x 11 columns]

In [3]:
sum = pd.DataFrame(df.iloc[:,1:6].values + df.iloc[:,6:].values)
pdiv = pd.concat([df['Unnamed: 0'],sum], axis=1)
pdiv.columns = ['Geography','White','Mixed','Asian','Black','Other']
pdiv = pdiv[['Geography','White', 'Black', 'Asian', 'Other', 'Mixed']]
pdiv.iloc[:,1:] = round(pdiv.iloc[:,1:],0)
pdiv.head()

           Geography   White  Black  Asian  Other  Mixed
0  Avon and Somerset  2677.0   11.0   16.0   10.0   37.0
1       Bedfordshire  1071.0   38.0   13.0    0.0   18.0
2     Cambridgeshire  1327.0   12.0    6.0    4.0   11.0
3           Cheshire  1977.0    6.0    2.0    2.0   12.0
4          Cleveland  1467.0   18.0    1.0    2.0    6.0

In [4]:
total = pdiv.iloc[:,1:].sum(axis=1)

for i in pdiv.columns[1:]:
  pdiv[i] = pdiv[i].copy() / total

pdiv.head()

           Geography     White     Black     Asian     Other     Mixed
0  Avon and Somerset  0.973101  0.003999  0.005816  0.003635  0.013450
1       Bedfordshire  0.939474  0.033333  0.011404  0.000000  0.015789
2     Cambridgeshire  0.975735  0.008824  0.004412  0.002941  0.008088
3           Cheshire  0.988994  0.003002  0.001001  0.001001  0.006003
4          Cleveland  0.981928  0.012048  0.000669  0.001339  0.004016

In [5]:
pdiv.iloc[:,1:] = np.square(pdiv.iloc[:,1:].copy())
pdiv.head()

           Geography     White     Black         Asian     Other     Mixed
0  Avon and Somerset  0.946925  0.000016  3.382663e-05  0.000013  0.000181
1       Bedfordshire  0.882611  0.001111  1.300400e-04  0.000000  0.000249
2     Cambridgeshire  0.952059  0.000078  1.946367e-05  0.000009  0.000065
3           Cheshire  0.978110  0.000009  1.001001e-06  0.000001  0.000036
4          Cleveland  0.964182  0.000145  4.480214e-07  0.000002  0.000016

In [6]:
# Using EFL index to Measure Diversity

pdiv['PD_Diversity'] = 1 - pdiv.iloc[:,1:].sum(axis=1)
police_div = pdiv[['Geography','PD_Diversity']]
police_div.sort_values(by='PD_Diversity',ascending=False).head()

              Geography  PD_Diversity
22  Metropolitan Police      0.190240
36        West Midlands      0.157681
18       Leicestershire      0.130356
1          Bedfordshire      0.115899
20      London, City of      0.111393

In [7]:
# Creating Csv file for Police Diversity

police_div.to_csv('police_diversity.csv')